fio/ceph-file-layout/bs_su256k_o4m/randr_s1m_j32.out
randr: (g=0): rw=randread, bs=(R) 8192B-8192B, (W) 8192B-8192B, (T) 8192B-8192B, ioengine=libaio, iodepth=1
...
fio-3.18
Starting 32 threads

randr: (groupid=0, jobs=32): err= 0: pid=47964: Thu Feb 20 23:56:09 2020
  read: IOPS=37.2k, BW=291MiB/s (305MB/s)(85.2GiB/300037msec)
    slat (usec): min=22, max=2471, avg=109.96, stdev=58.45
    clat (nsec): min=1493, max=276654k, avg=747485.03, stdev=1118420.64
     lat (usec): min=395, max=276722, avg=857.62, stdev=1119.83
    clat percentiles (usec):
     |  1.00th=[  469],  5.00th=[  519], 10.00th=[  545], 20.00th=[  586],
     | 30.00th=[  611], 40.00th=[  644], 50.00th=[  668], 60.00th=[  701],
     | 70.00th=[  742], 80.00th=[  791], 90.00th=[  873], 95.00th=[  963],
     | 99.00th=[ 2606], 99.50th=[ 4015], 99.90th=[ 6456], 99.95th=[11338],
     | 99.99th=[54789]
   bw (  KiB/s): min=211712, max=341120, per=100.00%, avg=298282.70, stdev=1273.32, samples=19137
   iops        : min=26464, max=42640, avg=37285.32, stdev=159.16, samples=19137
  lat (usec)   : 2=0.01%, 4=0.01%, 10=0.01%, 20=0.01%, 50=0.01%
  lat (usec)   : 100=0.01%, 250=0.01%, 500=2.93%, 750=69.75%, 1000=23.40%
  lat (msec)   : 2=2.66%, 4=0.76%, 10=0.45%, 20=0.02%, 50=0.02%
  lat (msec)   : 100=0.01%, 250=0.01%, 500=0.01%
  cpu          : usr=0.45%, sys=11.00%, ctx=22691304, majf=0, minf=8172
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=11171041,0,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=1

Run status group 0 (all jobs):
   READ: bw=291MiB/s (305MB/s), 291MiB/s-291MiB/s (305MB/s-305MB/s), io=85.2GiB (91.5GB), run=300037-300037msec