fio/ceph-file-layout/bs_su256k_o4m/randr_s1m_j8.out
randr: (g=0): rw=randread, bs=(R) 8192B-8192B, (W) 8192B-8192B, (T) 8192B-8192B, ioengine=libaio, iodepth=1
...
fio-3.18
Starting 8 threads

randr: (groupid=0, jobs=8): err= 0: pid=48849: Fri Feb 21 00:07:12 2020
  read: IOPS=13.2k, BW=103MiB/s (108MB/s)(30.3GiB/300002msec)
    slat (usec): min=18, max=687, avg=47.31, stdev=13.13
    clat (usec): min=3, max=20044, avg=555.27, stdev=238.07
     lat (usec): min=353, max=20093, avg=602.73, stdev=238.59
    clat percentiles (usec):
     |  1.00th=[  400],  5.00th=[  433], 10.00th=[  453], 20.00th=[  478],
     | 30.00th=[  494], 40.00th=[  510], 50.00th=[  529], 60.00th=[  545],
     | 70.00th=[  570], 80.00th=[  594], 90.00th=[  644], 95.00th=[  685],
     | 99.00th=[  898], 99.50th=[ 2376], 99.90th=[ 4228], 99.95th=[ 4555],
     | 99.99th=[ 5211]
   bw (  KiB/s): min=97568, max=112448, per=100.00%, avg=106013.51, stdev=279.92, samples=4792
   iops        : min=12196, max=14056, avg=13251.68, stdev=34.99, samples=4792
  lat (usec)   : 4=0.01%, 10=0.01%, 50=0.01%, 100=0.01%, 250=0.01%
  lat (usec)   : 500=33.73%, 750=63.93%, 1000=1.46%
  lat (msec)   : 2=0.29%, 4=0.46%, 10=0.13%, 20=0.01%, 50=0.01%
  cpu          : usr=0.58%, sys=6.23%, ctx=7493951, majf=0, minf=1677
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=3971177,0,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=1

Run status group 0 (all jobs):
   READ: bw=103MiB/s (108MB/s), 103MiB/s-103MiB/s (108MB/s-108MB/s), io=30.3GiB (32.5GB), run=300002-300002msec