fio/ceph-file-layout/bs_su256k_o4m/randr_s2g_j32.out
randr: (g=0): rw=randread, bs=(R) 8192B-8192B, (W) 8192B-8192B, (T) 8192B-8192B, ioengine=libaio, iodepth=1
...
fio-3.18
Starting 32 threads

randr: (groupid=0, jobs=32): err= 0: pid=31499: Thu Feb 20 20:26:23 2020
  read: IOPS=2575, BW=20.1MiB/s (21.1MB/s)(6037MiB/300070msec)
    slat (usec): min=22, max=988, avg=51.00, stdev=11.80
    clat (usec): min=4, max=312153, avg=12370.35, stdev=13131.25
     lat (usec): min=423, max=312200, avg=12421.52, stdev=13131.29
    clat percentiles (usec):
     |  1.00th=[   562],  5.00th=[   627], 10.00th=[   685], 20.00th=[  4948],
     | 30.00th=[  8029], 40.00th=[  9241], 50.00th=[ 10159], 60.00th=[ 11338],
     | 70.00th=[ 13304], 80.00th=[ 15926], 90.00th=[ 20841], 95.00th=[ 28443],
     | 99.00th=[ 84411], 99.50th=[ 90702], 99.90th=[106431], 99.95th=[113771],
     | 99.99th=[137364]
   bw (  KiB/s): min= 9664, max=32512, per=100.00%, avg=20630.75, stdev=161.02, samples=19168
   iops        : min= 1208, max= 4064, avg=2578.82, stdev=20.13, samples=19168
  lat (usec)   : 10=0.01%, 500=0.09%, 750=13.15%, 1000=2.34%
  lat (msec)   : 2=0.99%, 4=2.14%, 10=29.59%, 20=40.71%, 50=8.43%
  lat (msec)   : 100=2.35%, 250=0.20%, 500=0.01%
  cpu          : usr=0.03%, sys=0.32%, ctx=1498087, majf=0, minf=12310
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=772777,0,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=1

Run status group 0 (all jobs):
   READ: bw=20.1MiB/s (21.1MB/s), 20.1MiB/s-20.1MiB/s (21.1MB/s-21.1MB/s), io=6037MiB (6331MB), run=300070-300070msec