fio/ceph-file-layout/bs_su256k_o4m/seqr_s2g_j128.out
seqr: (g=0): rw=read, bs=(R) 64.0KiB-64.0KiB, (W) 64.0KiB-64.0KiB, (T) 64.0KiB-64.0KiB, ioengine=libaio, iodepth=1
...
fio-3.18
Starting 128 threads
seqr: Laying out IO file (1 file / 2048MiB)
seqr: Laying out IO file (1 file / 2048MiB)
seqr: Laying out IO file (1 file / 2048MiB)
[...]

seqr: (groupid=0, jobs=128): err= 0: pid=24198: Thu Feb 20 18:39:44 2020
  read: IOPS=7064, BW=442MiB/s (463MB/s)(129GiB/300207msec)
    slat (usec): min=19, max=2109, avg=45.66, stdev=16.14
    clat (usec): min=2, max=4619.6k, avg=18062.11, stdev=66300.22
     lat (usec): min=636, max=4619.7k, avg=18107.94, stdev=66301.42
    clat percentiles (usec):
     |  1.00th=[    799],  5.00th=[    865], 10.00th=[    906],
     | 20.00th=[    979], 30.00th=[   1057], 40.00th=[   1205],
     | 50.00th=[   3556], 60.00th=[   7767], 70.00th=[   9503],
     | 80.00th=[  16581], 90.00th=[  38536], 95.00th=[  74974],
     | 99.00th=[ 229639], 99.50th=[ 354419], 99.90th=[ 901776],
     | 99.95th=[1233126], 99.99th=[1971323]
   bw (  KiB/s): min=16300, max=2740992, per=100.00%, avg=483184.26, stdev=3305.25, samples=71514
   iops        : min=  253, max=42828, avg=7549.65, stdev=51.64, samples=71514
  lat (usec)   : 4=0.01%, 10=0.01%, 20=0.01%, 100=0.01%, 500=0.01%
  lat (usec)   : 750=0.17%, 1000=23.11%
  lat (msec)   : 2=23.81%, 4=3.86%, 10=20.68%, 20=12.24%, 50=8.29%
  lat (msec)   : 100=4.36%, 250=2.61%, 500=0.57%, 750=0.15%, 1000=0.07%
  lat (msec)   : 2000=0.07%, >=2000=0.01%
  cpu          : usr=0.02%, sys=0.24%, ctx=2986699, majf=0, minf=95472
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=2120744,0,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=1

Run status group 0 (all jobs):
   READ: bw=442MiB/s (463MB/s), 442MiB/s-442MiB/s (463MB/s-463MB/s), io=129GiB (139GB), run=300207-300207msec